{
  "train": {
    "1": [
      "I am feeling hungry so I would like to find a place to eat.",
      "Do you have a specific which you want the eating place to be located at?",
      "I would like for it to be in city_.",
      "Is there a specific cuisine type you enjoy, such as cuisine_, cuisine_ or something else?",
      "I usually like eating the cuisine_ type of food.",
      "I see that at restaurant_name_ there is a good restaurant which is in city_.",
      "Can you give me the address of this restaurant.",
      "If you want to go to this restaurant you can find it at street_address_.",
      "Can you give me the phone number that I can contact them with?",
      "If you want to phone them you can at phone_number_.",
      "Is there some other restaurant which you can suggest?",
      "How would you like restaurant_name_ restaurant which is situated in city_.",
      "Do you have another restaurant matching my needs? For example a restaurant which is economical and is located in city_.",
      "I see that count_ restaurants suit to what you requested. restaurant_name_ seems as a good restaurant and is located in city_.",
      "Alright, that seems good. I would like to make a booking at this restaurant.",
      "For which time do you want the booking to be?",
      "I will be eating there at time_ so make it for then.",
      "Can you please confirm that you want to book a table for party_size_ at time_ at the restaurant_name_ restaurant in city_ for date_.",
      "That suits me well. Can you tell me if they feature live music?",
      "Your booking has been made without errors, but unfortunately they do not have live music.",
      "Will I be able to find liquor there? Can you give me the address of their location?",
      "The restaurant is located at street_address_. Unfortunately they do not serve alcohol at the restaurant.",
      "I appreciate it very much. That would be all.",
      "Have a good time!"
    ],
    "2": [
      "Hi i need a help, i am very hungry, I am looking for a restaurant",
      "Sure, I will help you, What type of food are you looking for? Which city should i search in?",
      "Some cuisine_ kind of foods in city_",
      "I found a good restaurant in city_, The restaurant name is restaurant_name_",
      "Ok, What is the address? How pricey are they?",
      "Price range is price_range_, The address is street_address_",
      "Ok, Find me another restaurant?",
      "I found another restaurant for you, restaurant_name_ Restaurant at city_",
      "No, suggest me another Restaurant, Some cuisine_ type of food will be perfect",
      "I found count_ Restaurants, restaurant_name_ at city_",
      "Yes, it seems good for me",
      "shall i reserve a table here for you?",
      "Yes, I want it on date_",
      "please tell me what time is the reservation for?",
      "at time_",
      "Please confirm the following details: Booking a table at restaurant_name_ at city_ on date_ reservation time is time_, The reservation is for party_size_ people",
      "No, time change to time_ for party_size_ people",
      "Please confirm the following details: the reservation time is time_, The reservation is for party_size_ people",
      "Yes",
      "Congrats, your reservation is confirmed",
      "What is the Restaurant address, Do they have live music, I love it",
      "Sorry, They don't have live music, The restaurant address is street_address_",
      "Thank you very much for your help",
      "Shall i help you with anything else?",
      "No, Thanks",
      "You are welcome, have a great day"
    ],
    "3": [
      "Help me find a good restaurant.",
      "In which city are you looking for the restaurant and do you have any preferred cuisine?",
      "Find me cuisine_ cuisine in city_.",
      "Of the count_ Ethiopian restaurants in city_, restaurant_name_ is a good one.",
      "Do they have live music?",
      "I'm sorry. They do not have live music.",
      "That's okay. I'd like to reserve a table for date_.",
      "At what time will you be arriving at the restaurant?",
      "Reserve the table for the date_ at time_.",
      "Please confirm that you want to reserve a table for party_size_ at the restaurant_name_ in city_ for date_ at time_.",
      "That's right. Do they serve alcohol? And how expensive is the place?",
      "Sorry the reservation was not successful. Is there anything else I can assist you with?",
      "Can you check if a table is available at time_?",
      "Okay.Please confirm that you want to reserve a table for party_size_ at the restaurant_name_ in city_ for date_ at time_.",
      "That's correct.",
      "Your table has been reserved.",
      "Thank you. That's all I need for now.",
      "Have a great day!"
    ],
    "4": [
      "I'm looking for a place to eat.",
      "Which city should I search in? What kind of food are you looking for?",
      "Some cuisine_ kind of food in city_ would be perfect.",
      "I found count_ restaurants. restaurant_name_ is a nice restaurant in city_.",
      "Could you suggest any other restaurant?",
      "restaurant_name_ is another nice restaurant in city_.",
      "Yes, that works for me.",
      "Would you like to reserve a table here?",
      "Yes, I want to make a reservation for party_size_. Make it at time_.",
      "Please confirm: Booking a table for party_size_ at restaurant_name_ at time_ date_ in city_.",
      "Yes, that works for me. How pricey are they? What is their contact number?",
      "Your reservation is successful. Their price range is price_range_ and their phone number is phone_number_.",
      "Thank you very much.",
      "Can I help you with anything else?",
      "No, thank you very much.",
      "Have a good day."
    ],
    "5": [
      "I'd like to find a place to eat.",
      "Where should I look? What kind of food are you in the mood for? You can say things like cuisine_, cuisine_ or any other kind of food.",
      "cuisine_ sounds great. Please search in city_.",
      "I have found count_ restaurants. restaurant_name_ is a great restaurant in city_.",
      "What's their phone number?",
      "Their number is phone_number_.",
      "Any other suggestions?",
      "restaurant_name_ is another great choice in city_.",
      "Do they have live music?",
      "They do not.",
      "Any other suggestions?",
      "restaurant_name_ would be a great choice in city_.",
      "That would work great. I would like to make a reservation there at time_ on date_.",
      "Please confirm the following: You want to eat at restaurant_name_ in city_ on date_ starting at time_. The reservation would be for party_size_ people.",
      "Yes, that would be great. Do they serve liquor or have live music?",
      "Your reservation was successful. They do not play live music or serve alcohol.",
      "Thanks so much!",
      "Is there anything else today?",
      "Nope, that'll be all. Thanks!",
      "Have a great day!"
    ],
    "6": [
      "I'm looking for a cuisine_ place to eat.",
      "Which City are you looking at?",
      "I want to eat in city_",
      "I have count_ restaurants, restaurant_name_ is a nice one in city_.",
      "Any other suggestions?",
      "What about restaurant_name_ in city_?",
      "How cheap is it and how much does it cost?",
      "It is price_range_ pricing and they are at street_address_",
      "Please can you make the reservation",
      "What time for?",
      "On date_ at time_",
      "Please confirm: Booking a table for party_size_ at restaurant_name_ in city_. It is on date_ at time_.",
      "That's good. Do they serve liquor and what is there number?",
      "Reservation made.The number is phone_number_ and they do serve alcohol.",
      "Thanks a lot",
      "Have a great day."
    ],
    "7": [
      "Can you help find a place to eat?",
      "What kind of food like cuisine_ or cuisine_?",
      "I would like cuisine_.",
      "Do you have a city?",
      "The city is city_.",
      "I have one in city_ called restaurant_name_.",
      "Yes that is fine.",
      "Would you like a reservation?",
      "Yes make it for date_.",
      "What time would you like?",
      "Reserve for time_.",
      "Please confirm restaurant_name_ in city_ for time_ on date_ for party_size_.",
      "Yes what is the address and do they have live music?",
      "The address is street_address_ and they do not have live music but your reservation is confirmed.",
      "Thank you for all.",
      "Is there anything else I can do?",
      "No, that is all.",
      "Thanks and have a good day."
    ],
    "8": [
      "My friend and I are looking for a place to eat.",
      "Please tell me what type of food you are looking for just say cuisine_, cuisine_ or anything else. Also what city would you like me to search int.",
      "My family and I are in city_ and the perfect place would have cuisine_. We don't have a price preference.",
      "city_ has a restaurant called restaurant_name_ that is nice.",
      "Is there any other restaurant that you can suggest?",
      "There is also a nice restaurant called restaurant_name_ in city_.",
      "Can I please have the address and contact number?",
      "phone_number_ is their phone and it is located at street_address_.",
      "Is there any other restaurant that you can suggest?",
      "There is another nice restaurant called restaurant_name_ in city_.",
      "That restaurant will work can you please make a reservation for time_.",
      "I will be booking a table at restaurant_name_ in city_. The reservation will be set at time_ for date_. And it is for party_size_ people is this correct.",
      "Yes, thank you that is correct.",
      "I have successful made your reservation.",
      "Thank you so much for setting that up.",
      "Is there anything else that I can help you with.",
      "That is all thank you so much.",
      "Have a good day thank you."
    ],
    "9": [
      "Can you find me something economical to eat in city_.",
      "Are you looking for cuisine_, cuisine_ or something else?",
      "I would like some cuisine_ food.",
      "Found count_ restaurants for you out of which restaurant_name_ seems a great from city_.",
      "Can you provide the address and do they have live music?",
      "No, they do not have live music and its address is street_address_.",
      "Any other recommendation?",
      "restaurant_name_ also seems nice and its located n city_ as well.",
      "Can you provide more options?",
      "Another good restaurant in city_ in Gay 90's Pizza Co.",
      "That sounds like a good choice for me.",
      "Is there anything else?",
      "Yes, make a reservation at the restaurant.",
      "What time do you want me to make the reservation?",
      "I'll reach there at time_.",
      "Please confirm that you want to make a reservation at Gay 90's Pizza Co. which is located in city_ for party_size_ people. The reservation is for date_ at time_.",
      "No, change the time to time_ and for party_size_ person only.",
      "Alright, please confirm that the reservation is at time_ for party_size_ person.",
      "No, change it on date_.",
      "Sure. Please confirm that the date is now date_ and for party_size_ person.",
      "Yes. Sounds good.",
      "Your reservation is booked.",
      "What is the address of the restaurant and do the have live music?",
      "The address is street_address_ and No, they don't have live music either.",
      "Alright, Thank you.",
      "Have a great day."
    ],
    "10": [
      "I am looking to eat somewhere",
      "What city would you like to go? Do you want cuisine_ or cuisine_?",
      "I want some cuisine_ in city_",
      "I recommend restaurant_name_ in city_",
      "Do they have live music with liquor",
      "They do not have live music but they do have alcohol",
      "ok that works",
      "Do you want me to reserve a table for you",
      "Yes, please make reservation for party_size_ people this time_",
      "Please confirm your booking at restaurant_name_ in city_ for party_size_ people date_ at time_",
      "thats correct. What is their phone number what how expensive are they",
      "Sorry, they are fully booked. Shall i try to make reservation for party_size_ people date_ at time_? The price range is Moderate at restaurant_name_ and their phone number is phone_number_",
      "yes thats fine",
      "your seat is booked",
      "thanks",
      "anything else i can help you with?",
      "no thats it",
      "have a nice day"
    ]
  },
  "valid": {
    "1": [
      "I want to make a restaurant reservation for number_of_seats_ people at time_.",
      "What city do you want to dine in? Do you have a preferred restaurant?",
      "Please find restaurants in location_. Can you try restaurant_name_?",
      "Confirming: I will reserve a table for number_of_seats_ people at restaurant_name_ in location_. The reservation time is time_ date_.",
      "Yes, thanks. What's their phone number?",
      "Your reservation has been made. Their phone number is phone_number_.",
      "What's their address? Do they have vegetarian options on their menu?",
      "The street address is address_. They have good vegetarian options.",
      "Thanks very much.",
      "Is there anything else I can help you with?",
      "No, that's all. Thanks.",
      "Have a great day."
    ],
    "2": [
      "I am not in the mood to cook today. I want to eat out at a restaurant instead.",
      "Which area would you like me to look in? Which restaurant would you like to eat in and at what time?",
      "Look for a restaurant in location_. Check to see if I can have a table for number_of_seats_ at restaurant_name_ for time_.",
      "You would like a table for number_of_seats_ person for date_ at time_ at the restaurant_name_ in location_?",
      "I would like to book at table at restaurant_name_ for date_.",
      "You would like me to book a table at restaurant_name_ for date_?",
      "I want the eat there on the date_.",
      "You would like to reserve a table for time_ for date_?",
      "That would be fine. Is the restaurant costly?",
      "My apologies. The reservation was unsuccessful. Is there anything else I can assist you with?",
      "No thanks. You have been very helpful.",
      "Enjoy your day."
    ],
    "3": [
      "I want to reserve a table at a restaurant, specifically restaurant_name_.",
      "Which location of Bourbon Steak do you want to save a table?",
      "Find Bourbon Steaks in location_ please.",
      "What time do you want to book the table for?",
      "Please do it for time_.",
      "Okay. Just to be clear, you want a table at restaurant_name_ in location_ for number_of_seats_ people date_ at time_.",
      "Yes, that is correct.",
      "Alright. Your reservation has been made.",
      "Thanks for your help. That will be it.",
      "Have a great day."
    ],
    "4": [
      "I would like to make a restaurant reservation at time_.",
      "Which restaurant do you want to go to?",
      "Can I get a reservation at restaurant_name_?",
      "Which location do you want to get the reservation at?",
      "Find a restaurant in location_.",
      "Please confirm you want to make a reservation for number_of_seats_ people date_ at time_ at restaurant_name_ in location_.",
      "The reservation is just for number_of_seats_ person.",
      "Please confirm you want a reservation for number_of_seats_ person date_.",
      "That is correct.",
      "The reservation could not be made. Do you want to make a reservation for number_of_seats_ person date_ at time_ at restaurant_name_?",
      "Not at this time.",
      "See you soon!"
    ],
    "5": [
      "I want to make a dinner reservation on date_.",
      "What area are you looking in? What time do you want the reservation for?",
      "I want a restaurant in location_, for time_, please.",
      "Which restaurant do you want to book a table at?",
      "Can you get me a table at restaurant_name_?",
      "So you want a table for number_of_seats_ people date_ at time_ at restaurant_name_ in location_?",
      "Yes, that's right.",
      "Your table has been reserved.",
      "What type of food do they serve, and what's the address?",
      "They serve category_ food. They are located at address_.",
      "Thanks. That's all.",
      "Have a nice day."
    ],
    "6": [
      "I want to make a reservation at a restaurant.",
      "Okay, I can do that. Is there a particular restaurant that you wish to visit?",
      "Can you look at restaurant_name_ in location_?",
      "Yes. What time?",
      "Try for time_.",
      "No problem, please confirm: reservation for number_of_seats_ at restaurant_name_ in location_, date_ at time_.",
      "Make it for number_of_seats_ people.",
      "Okay, please confirm: reservation for number_of_seats_ people at restaurant_name_.",
      "Actually, can we change it to Big number_of_seats_.",
      "Please confirm: table for number_of_seats_ people at restaurant_name_.",
      "Yes, that's right.",
      "I'm sorry, I couldn't make that reservation for you. Is there anything else I can help you with today?",
      "No, that's it.",
      "Have a great day."
    ],
    "7": [
      "I need to taste good food , i am very much eager to taste different food varieties from my normal routine food. Will you book a table at a restaurant?",
      "At which location i should search for and at what time i need to book a table ? whether any special restaurant you like to book a table?",
      "Find restaurants in location_ and at time time_ ? Can you try booking a table at restaurant_name_?",
      "ok please check and review the details for confirmation. Table need to be booked at restaurant_name_ in the city location_ at time time_ and number of people is number_of_seats_ for the date is date_.",
      "No Find restaurants in location_ and Book a table at restaurant_name_?",
      "Ok please once again check and review the following details. Table need to be booked at restaurant_name_ at the city location_.",
      "Ok That's correct.",
      "Reservation is successful.",
      "Thanks a lot for your help. thats all i need",
      "Take care have a great day"
    ],
    "8": [
      "I want to go out to eat somewhere.",
      "Do you know what restaurant you would like to go to? Or at least what city you want to eat in?",
      "I want a restaurant in location_. I heard that a place called restaurant_name_ is really good. I wonder if it has any free seats?",
      "What time would you like to eat there at?",
      "I'd love to go there for lunch, so time_.",
      "You want to make a reservation for number_of_seats_ at restaurant_name_ in location_ for time_ date_. Is that correct?",
      "No. The reservation should be for number_of_seats_ people, and it should be for the date_.",
      "You want me to book a table for date_ for number_of_seats_?",
      "Yeah. I wonder what I should wear? Is restaurant_name_ an ultra high-end restaurant?",
      "Sorry, I can't book a table for you. Do you need anything else?",
      "That's all, thanks.",
      "Enjoy your day."
    ],
    "9": [
      "I'd like to make a restaurant reservation.",
      "What's the restaurant, where is it located, and what time would you like the reservation for?",
      "It's called restaurant_name_ and you can look for it in location_. I want the reservation for time_.",
      "I'll make a reservation for restaurant_name_ in location_ date_ at time_ for number_of_seats_ people, is that correct?",
      "Yeah, that's right. Do they do outdoor seating?",
      "They don't have outdoor seating. I also was not able to make the reservation. How about date_ at time_ for number_of_seats_ people at restaurant_name_ instead?",
      "That won't work for me.",
      "Do you any other kinds of help from me?",
      "No, thanks a lot.",
      "Okay, have a pleasant day."
    ],
    "10": [
      "I wanna book a restaurant reservation on the date_",
      "What restaurant do you want?",
      "Can you find me a table at restaurant_name_",
      "What time do you want me to reserve?",
      "Try for time_",
      "Which branch do you want?",
      "Find me one in location_",
      "There's a restaurant_name_ in location_ than I can reserve at time_ for number_of_seats_ people on date_.",
      "Yes that works, but do they have vegetarian options?",
      "Your reservation is made, and no they don't have any vegetarian options unfortunately.",
      "What is their phone number and address?",
      "It's phone_number_ and it's at address_",
      "Thank you so much, that's it for now.",
      "Sure thing, have a good one"
    ]
  },
  "test": {
    "1": [
      "Hi, could you get me a restaurant booking on the 8th please?",
      "Any preference on the restaurant, location and time?",
      "Could you get me a reservation at P.f. Chang's in Corte Madera at afternoon 12?",
      "Please confirm your reservation at restaurant_name_ in location_ at time_ for number_of_seats_ on date_.",
      "Sure, that is great.",
      "Sorry, your reservation could not be made. Could I help you with something else?",
      "Could you try booking a table at Benissimo instead?",
      "Sure, please confirm your reservation at restaurant_name_ in location_ at time_ for number_of_seats_ on date_.",
      "Sure, may I know if they have vegetarian options and how expensive is their food?",
      "Your reservation has been made. Unfortunately, they do not serve vegetarian options, although they are price_range_ priced.",
      "I see, thanks alot!",
      "No worries, could I further assist you?",
      "No, that is all. Thank you!",
      "Have a great day ahead!"
    ],
    "2": [
      "Can you book a table for me at the Ancient Szechuan for the 11th of this month at 11:30 am?",
      "In which city are you trying to book the table?",
      "Can you book a table at the Butterfly restaurant in San Francisco?",
      "Please confirm that you need a table for number_of_seats_ at the restaurant_name_ in location_ at time_ on date_.",
      "That's perfect. What cuisine do they offer?",
      "Your table has been booked successfully and they serve category_ cuisine.",
      "Can you get me the user rating of the restaurant? Is it expensive?",
      "Their prices are price_range_ and they have a user rating of rating_.",
      "Thanks a bunch!",
      "Is there anything else I can do for you?",
      "No. Thank you. That's all I need.",
      "Have a great day!"
    ],
    "3": [
      "Can you check restaurants in Pacifica, I'm looking to make a reservation.",
      "Is there a particular restaurant you want? What time did you want the reservation?",
      "See if you can get one at Puerto 27 for 1:15 pm.",
      "To verify: You would like a reseravation at restaurant_name_ in location_ for time_ on date_ for number_of_seats_.",
      "Yes that's right.",
      "Your table is reserved.",
      "Thanks so much. That's all I need for now.",
      "Have a great day."
    ],
    "4": [
      "I need to book a dinner reservation for a date. Help me reserve a table at a restaurant.",
      "What time and location do you have in mind?",
      "Something around 8 in the night should be fine. Oh, and look in the San Jose area.",
      "Do you have a specific restaurant in mind?",
      "Let's try booking a table at Little Hunan.",
      "You wish to reserve a table for number_of_seats_ at restaurant_name_ in location_ on date_ at time_. Is that correct?",
      "It sure is. Please make the reservation right away.",
      "I was not able to process your reservation. I apologize for any inconvenience.",
      "Okay. Try booking a table at Little Hunan again but make it at a quarter past 5 in the evening.",
      "Booking a table at restaurant_name_ located in location_. The reservation is for number_of_seats_ people on date_ at time_. Is that right?",
      "That's correct. Let's hope the reservation goes through this time.",
      "I was unable to book your table with those details. If you like, I can make a reservation for you at restaurant_name_ on date_ at time_ for number_of_seats_ people.",
      "Really? That'll work just fine. Please try that.",
      "I have made your reservation and successfully reserved your table.",
      "At last. Thank you so much. Before I let you go, can you tell me the restaurant's user rating?",
      "The user rating for Little Hunan is rating_.",
      "Are there any vegetarian dishes available at that restaurant?",
      "I apologize but they do not have vegetarian dishes.",
      "That's alright. Thanks for the information.",
      "My pleasure. What else do you require?",
      "Oh nothing. Booking the table was all I needed. Thanks again.",
      "Have a wonderful evening."
    ],
    "5": [
      "Can you book a reservation for a restaurant at this evening 5:30?",
      "At which restaurant would you like to make a reservation?",
      "See if you can get a table at Mi Zacatecas.",
      "In which location is Mi Zacatecas?",
      "It's in American Canyon.",
      "Please confirm the following: Book 1 table at restaurant_name_ in location_ for number_of_seats_ at time_ on date_.",
      "Confirm. Can you tell me what type of food they serve there?",
      "The reservation has successfully been made. They serve category_ food.",
      "Great, that will be all.",
      "Enjoy the rest of your day."
    ],
    "6": [
      "I need to book a table at a restaurant.",
      "At which time would you like to reserve it for?",
      "I want it at 1:15 in the afternoon, please.",
      "In which location would you like it? What is the restaurant name?",
      "I need a table at Saap Ver, in San Francisco.",
      "Please confirm the following information: Book a table at restaurant_name_, in location_ at time_ on the day of date_. This is for a party of number_of_seats_, correct?",
      "Yes, that is everything. Address?",
      "Sorry, but the reservation could not be placed. Is there anything else to help with?",
      "No, but thanks.",
      "Of course. Have a wonderful day."
    ],
    "7": [
      "I'm looking to book a table. Can you try Triptych in SF?",
      "Of course, what time would you prefer?",
      "Give me 6:15 in the evening please.",
      "Here's what I heard: number_of_seats_ people for a table at restaurant_name_ in location_ at time_ on date_.",
      "No, wrong. Give me Friday next week instead.",
      "Sure, I have booking table at restaurant_name_ on date_.",
      "No, one more time. One person.",
      "I have date_ number_of_seats_ person.",
      "Yes, that's a winner thanks. Do they have vegetarian options?",
      "Well, good news bad news. First they DO have vegetarian options at restaurant_name_. Bad news, no availability at your preferred time. How about date_ at time_ for number_of_seats_?",
      "No, that will not do.",
      "Sorry about that, have a good day."
    ],
    "8": [
      "I would like to make a reservation at a restaurant for half past 1 in the afternoon.",
      "In which restaurant would you like a table?",
      "I would like a table at Left Bank.",
      "In which location would you like?",
      "I would like a restaurant in Larkspur.",
      "Booking a table at restaurant_name_ in location_ for number_of_seats_ people on date_ at time_.",
      "Yes, that reservation is good.",
      "Your reservation was made.",
      "Thank you for your assistance.",
      "Have a good day."
    ],
    "9": [
      "I need to make a reservation for a restaurant in Oakland. The reservation should be for next Wednesday at 6:45 pm.",
      "Which restaurant would you like me to make a reservation for?",
      "Can you book me a table at Mcdonald's?",
      "Please confirm: Reserve 1 table at restaurant_name_ in location_ for number_of_seats_ people on date_ at time_.",
      "That is correct. How expensive is the restaurant and does it have outdoor seating?",
      "Your reservation has been made. It is a price_range_ restaurant. It does not have outdoor seating.",
      "Thank you.",
      "Can I assist you with anything else?",
      "No thanks.",
      "Enjoy your day."
    ],
    "10": [
      "I want to make a restaurant reservation.",
      "What's the name of the restaurant and what time would you like the reservation?",
      "It's name is La Hacienda and I want the reservation for 2 o\"clock in the afternoon.",
      "And where is the restaurant located?",
      "It's in Cloverdale.",
      "I'll make a reservation for restaurant_name_ in location_ for date_ at time_ for number_of_seats_ people, is that good for you?",
      "Yeah,that's good. What's the user rating of the restaurant?",
      "I'm sorry, but the reservation couldn't be completed. Is there anything else you need?",
      "No, thanks a lot.",
      "You're welcome, have a fine day."
    ]
  }
}